app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("doctor_id", "pet_id", "customer_name", "appointment_reminder", "reason_for_visit", "date_of_visit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]