app/controllers/customers_controller.rb

  def index
    @customers = Appointment.includes(:doctor, :pet)
---
SELECT  "appointments".* FROM "appointments"  ORDER BY "appointments"."id" ASC LIMIT 1
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" IN (1)
SELECT "pets".* FROM "pets" WHERE "pets"."id" IN (1)