app/controllers/pets_controller.rb

  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("name", "type_of_pet", "breed", "age", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test"], ["type_of_pet", "dog"], ["breed", "tetetet"], ["age", 11], ["weight", 22], ["created_at", "2015-12-08 10:30:59.373490"], ["updated_at", "2015-12-08 10:30:59.373490"]]

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]